## DNS
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                          NAME                          |
|--------|--------------------------------------------------------|
| delete | `aws_route53_record.gccatalogue-alpha-canada-ca-NS`    |
| add    | `aws_route53_record.gccatalogue-alpha-canada-ca-CNAME` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_route53_record.gccatalogue-alpha-canada-ca-CNAME will be created
  + resource "aws_route53_record" "gccatalogue-alpha-canada-ca-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gccatalogue.alpha.canada.ca"
      + records         = [
          + "gcdigitalpolicy.github.io",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z33C47YI9EN8XL"
    }

  # aws_route53_record.gccatalogue-alpha-canada-ca-NS will be destroyed
  # (because aws_route53_record.gccatalogue-alpha-canada-ca-NS is not in configuration)
  - resource "aws_route53_record" "gccatalogue-alpha-canada-ca-NS" {
      - fqdn                             = "gccatalogue.alpha.canada.ca" -> null
      - id                               = "Z33C47YI9EN8XL_gccatalogue.alpha.canada.ca_NS" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "gccatalogue.alpha.canada.ca" -> null
      - records                          = [
          - "ns1-02.azure-dns.com",
          - "ns2-02.azure-dns.net",
          - "ns3-02.azure.dns.org",
          - "ns4-02.azure-dns.info",
        ] -> null
      - ttl                              = 300 -> null
      - type                             = "NS" -> null
      - zone_id                          = "Z33C47YI9EN8XL" -> null
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.Route53TerraformDeploy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.notify_prod_dns_manager_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.notify_prod_dns_manager"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.dns-github-deployer"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.alpha-canada-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.cds-snc-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.platform-canada-ca-public"]

26 tests, 19 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
